#+title:      A Klasse 2019-23
#+date:       [2022-12-28 Mi 20:52]
#+filetags:   :4a:Project:
#+identifier: 20221228T205258
#+CATEGORY: golling

* 4a 08:40-09:30
<%%(org-class 2022 9 12 2023 7 3 1 22)>

Dreifaltigkeitssonntag

YouCat über Dreifaltigkeit

Abschlussfeier?

Film "Cars 2" bis ... 


* 4a 09:35-10:25
<%%(org-class 2022 9 16 2023 7 7 5 23)>



* Reflexionen
 
** Null Bock mehr!
PERIOD: [2023-04-24 Mo 08:40]

Ich mag nimmer - ich werde umsatteln - werde nimmer Lehrer sein. Hat null Zweck. Suche ein Gespräch mit meinen Verantwortlichen. Den Schülern interessiert es einen Dreck; was oll ich mich abrackern und fertig machen für nix? Sicher nicht!

Mir wird wohl nix anderes übrig bleiben, als die Klasse noch bis zum Ende des Schuljahres zu ertragen. Da ist Hopfen und Malz verloren, nix mehr zu amchen. Außer: ich gehe einen harten Kurs und knalle ihnen regelmäßig eine LZK hin.

* 4A [KV Barbara Essl]

#+Name: 2021-students
| First         | Last        | Name                      | Note | Mitarbeit | Heft | LZK |
|---------------+-------------+---------------------------+------+-----------+------+-----|
| Johannes      | Aschner     | [[Johannes Aschner][Johannes Aschner]]          |    1 |           |      |     |
| Denise        | Gaulke      | [[Denise Gaulke][Denise Gaulke]]             |    1 |           |      |     |
| Zita          | Hofer       | [[Zita Hofer][Zita Hofer]]                |    1 |           |      |     |
| Michael       | Höllweger   | [[Michael Höllweger][Michael Höllweger]]         |    1 |           |      |     |
| Anna          | Hornegger   | [[Anna Hornegger][Anna Hornegger]]            |    1 |           |      |     |
| Emily         | Loidfellner | [[Emily Loidfellner][Emily Loidfellner]]         |    1 |           |      |     |
| Michelle      | Neureiter   | [[Michelle Neureiter][Michelle Neureiter]]        |    1 |           |      |     |
| Selina        | Neureiter   | [[Selina Neureiter][Selina Neureiter]]          |    1 |           |      |     |
| Florian       | Pointner    | [[Florian Pointner][Florian Pointner]]          |    1 |           |      |     |
| Theresa       | Reiter      | [[Theresa Reiter][Theresa Reiter]]            |    1 |           |      |     |
| Lukas         | Russegger   | [[Lukas Russegger][Lukas Russegger]]           |    1 |           |      |     |
| Lorena        | Schefbänker | [[Lorena Schefbänker][Lorena Schefbänker]]        |    1 |           |      |     |
| Maximilian    | Schönauer   | [[Maximilian Schönauer][Maximilian Schönauer]]      |    1 |           |      |     |
| Lara          | Schreder    | [[Lara Schreder][Lara Schreder]]             |    1 |           |      |     |
| David-Philipp | Strubreiter | [[David-Philipp Strubreiter][David-Philipp Strubreiter]] |    1 |           |      |     |
| Johanna       | Strubreiter | [[Johanna Strubreiter][Johanna Strubreiter]]       |    1 |           |      |     |
| Melanie       | Tikvic      | [[Melanie Tikvic][Melanie Tikvic]]            |    1 |           |      |     |
|---------------+-------------+---------------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $4='(identity remote(2021-22-Mitarbeit,@@#$4))

#+BEGIN_SRC python :var table=2021-students :results output raw
print('* Mitarbeit')
for student in table:
    first = student[0]
    last = student[1]
    email = first + '.' + last + '@golling.schule'
    print('** ' + first + ' ' + last + '\n\n')  
#+END_SRC

#+RESULTS:
* Mitarbeit
** Johannes Aschner


** Denise Gaulke


** Zita Hofer


** Michael Höllweger


** Anna Hornegger


** Emily Loidfellner


** Michelle Neureiter


** Selina Neureiter


** Florian Pointner


** Theresa Reiter


** Lukas Russegger


** Lorena Schefbänker


** Maximilian Schönauer


** Lara Schreder


** David-Philipp Strubreiter


** Johanna Strubreiter


** Melanie Tikvic


